title: Forg365 C2 Domain Access
id: c6afb62b-84a1-43e9-ad5d-18c66459e699
author: DetectHQ by GanaSec
date: 2026/07/13
falsepositives:
  - Unlikely
logsource:
  product: webproxy
  service: proxy
detection:
  selection:
    DestinationDomain|contains:
      - 'logfriend.com'
  token_api:
    DestinationUrl|contains:
      - '/api/v1/token'
  condition: selection and token_api
level: high
status: experimental
description: Detects outbound HTTP/S connections to the known Forg365 command‑and‑control domain, with emphasis on the token‑delivery endpoint.
references:
  - https://detecthq.in