title: TuxBot v3 Evolution C2 Communication Detection
falsepositives:
  - Unlikely
id: 9f2c7e5b-3d1a-4b9e-9c2f-1a2b3c4d5e6f
status: experimental
logsource:
  product: windows
  service: dns
  category: dns
detection:
  selection_dns:
    QueryName|contains:
      - 'newtuxdev.sevielw.digikalas.online'
      - 'digikalas.online'
      - 'c2.tuxbot.local'
      - 'api.digikalas.online'
      - 'health.digikalas.online'
      - 'tuxbot.alpha'
  condition: selection_dns
metadata:
  author: DetectHQ by GanaSec
  references:
    - https://detecthq.in
  date: 2026/07/15